package com.tearsmart.design.template;

/**
 * <p>
 * |****************************** *_* ******************************|
 * |   __                                                      __    |
 * | _/  |_  ____ _____ _______    ______ _____ _____ ________/  |_  |
 * | \   __\/ __ \\__  \\_  __ \  /  ___//     \\__  \\_  __ \   __\ |
 * |  |  | \  ___/ / __ \|  | \/  \___ \|  Y Y  \/ __ \|  | \/|  |   |
 * |  |__|  \___  >____  /__|    /____  >__|_|  (____  /__|   |__|   |
 * |            \/     \/             \/      \/     \/              |
 * |                                                                 |
 * |****************************** *_* ******************************|
 * </p>
 * @author tear-smart
 * @date 2019-03-27
 */
public class Gtrain extends AbstractTemplate {
    /**
     * 根据不同类型的车票选择不同的检票方式
     */
    @Override
    public void checkedTicket() {
        System.out.println("检票进站:");
        System.out.println("    1.出示身份证+车票!");
        System.out.println("    2.闸机刷身份证!");
    }
}
