package com.tearsmart.design.observer;

import java.util.Observable;

/**
 * <p>
 * |****************************** *_* ******************************|
 * |   __                                                      __    |
 * | _/  |_  ____ _____ _______    ______ _____ _____ ________/  |_  |
 * | \   __\/ __ \\__  \\_  __ \  /  ___//     \\__  \\_  __ \   __\ |
 * |  |  | \  ___/ / __ \|  | \/  \___ \|  Y Y  \/ __ \|  | \/|  |   |
 * |  |__|  \___  >____  /__|    /____  >__|_|  (____  /__|   |__|   |
 * |            \/     \/             \/      \/     \/              |
 * |                                                                 |
 * |****************************** *_* ******************************|
 * java8 已经实现了一套观察者模式
 * 其中change 属性,可以通过setChange()方法,手动控制当前变化是否通知观察者
 * </p>
 * @author tear-smart
 * @date 2019-03-27
 */
public class WechatAdvice extends Observable implements Subject{

}
